УчетВУправляющихДляГит1/src/Catalogs/ВидыТарифовСтраховыхВзносов/ВидыТарифовСтраховыхВзносов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыТарифовСтраховыхВзносов</name>
  <predefined>
    <items>
      <name>БлаготворительныеОрганизации</name>
      <description>Благотворительные организации</description>
    </items>
    <items>
      <name>ДляФармацевтовАптек</name>
      <description>Для фармацевтов аптек</description>
    </items>
    <items>
      <name>ДляЧленовЭкипажейМорскихСудовПодФлагомРФ</name>
      <description>Для членов экипажей морских судов под флагом РФ</description>
    </items>
    <items>
      <name>ИндивидуальныйПредпринимательПрименяющийПатент</name>
      <description>Индивидуальный предприниматель, применяющий патент</description>
    </items>
    <items>
      <name>НекоммерческиеОрганизации</name>
      <description>Некоммерческие организации</description>
    </items>
    <items>
      <name>СМИ</name>
      <description>Организации - средства массовой информации</description>
    </items>
    <items>
      <name>ОрганизацияИнвалидов</name>
      <description>Организации инвалидов</description>
    </items>
    <items>
      <name>НародныеХудожественныеПромыслы</name>
      <description>Организации народных художественных промыслов и семейных (родовых) общин</description>
    </items>
    <items>
      <name>Мультипликаторы</name>
      <description>Организации-производители анимации</description>
    </items>
    <items>
      <name>СельХозПроизводители</name>
      <description>Организации-с/х производители, применяющие ОСН</description>
    </items>
    <items>
      <name>ЕСХН</name>
      <description>Организации-с/х производители, уплачивающие ЕСХН</description>
    </items>
    <items>
      <name>ОрганизацииОказывающиеИнжиниринговыеУслуги</name>
      <description>Организации, оказывающие инжиниринговые услуги</description>
    </items>
    <items>
      <name>УпрощенныйНалоговыйРежимПроизводство</name>
      <description>Организации, применяющие УСН, занятые производством и приравненными видами деятельности</description>
    </items>
    <items>
      <name>ITОрганизации</name>
      <description>Организации, работающие в области информационных технологий</description>
    </items>
    <items>
      <name>ОбщийНалоговыйРежим</name>
      <description>Основной тариф страховых взносов</description>
    </items>
    <items>
      <name>УпрощенныйНалоговыйРежим</name>
      <description>Основной тариф, организации или ИП на УСН</description>
    </items>
    <items>
      <name>ЕНВД</name>
      <description>Основной тариф, организации или ИП, уплачивающие ЕНВД</description>
    </items>
    <items>
      <name>РезидентОсобойЗоныВКалининградскойОбласти</name>
      <description>Резидент особой зоны в Калининградской области</description>
    </items>
    <items>
      <name>РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития</name>
      <description>Резидент территории опережающего социально-экономического развития</description>
    </items>
    <items>
      <name>РезидентПортаВладивосток</name>
      <description>Резиденты свободного порта Владивосток</description>
    </items>
    <items>
      <name>РезидентТехникоВнедренческойЗоны</name>
      <description>Резиденты технико-внедренческой особой экономической зоны</description>
    </items>
    <items>
      <name>УчастникПроектаИнновационныйЦентрСколково</name>
      <description>Участник проекта инновационный центр &quot;Сколково&quot;</description>
    </items>
    <items>
      <name>УчастникОсобойЗоныВКрыму</name>
      <description>Участник свободной экономической зоны в Крыму</description>
    </items>
    <items>
      <name>ХозОбществаБюджетныхВУЗов</name>
      <description>Хозяйственные общества, созданные бюджетными научными учреждениями и ВУЗами</description>
    </items>
  </predefined>
  <attributes>
    <name>КодФНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПФР2011</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФСС2011</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПФР2012</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФСС2012</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяПоОтдельнымДоходам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификаторОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяТерриториальнымТарифом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Catalogs/ВидыТарифовСтраховыхВзносов/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	УчетСтраховыхВзносовВызовСервера.ВидыТарифовСтраховыхВзносовОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
КонецПроцедуры

#КонецОбласти


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция ПараметрыДляДоступныхТарифов(Параметры) Экспорт
	
	ПараметрыДляДоступныхТарифов = Новый Структура("ВидОрганизации, ПрименяетсяУСН, ПрименяетсяПоОтдельнымДоходам, ЯвляетсяТерриториальнымТарифом", Неопределено, Неопределено, Неопределено, Неопределено);
	
	Организация = Неопределено;
	Параметры.Свойство("Организация", Организация);
	
	Период = Неопределено;
	Параметры.Свойство("Период",Период);
	
	ПрименяетсяУСН = Неопределено;
	Параметры.Свойство("ПрименяетсяУСН", ПрименяетсяУСН);
	
	ПрименяетсяПоОтдельнымДоходам = Неопределено;
	Параметры.Отбор.Свойство("ПрименяетсяПоОтдельнымДоходам",ПрименяетсяПоОтдельнымДоходам);
	
	ЯвляетсяТерриториальнымТарифом = Неопределено;
	Параметры.Отбор.Свойство("ЯвляетсяТерриториальнымТарифом",ЯвляетсяТерриториальнымТарифом);
	
	Если ЗначениеЗаполнено(Организация) ИЛИ ЗначениеЗаполнено(ПрименяетсяУСН) ИЛИ ЗначениеЗаполнено(Период) ИЛИ ЗначениеЗаполнено(ПрименяетсяПоОтдельнымДоходам) ИЛИ ЗначениеЗаполнено(ЯвляетсяТерриториальнымТарифом) Тогда
		
		ВидОрганизации = Неопределено;
		Если ЗначениеЗаполнено(Организация) Тогда
			ВидОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮридическоеФизическоеЛицо");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПрименяетсяУСН) И ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Период) Тогда
			ПрименяетсяУСН = ЗарплатаКадрыПереопределяемый.ОрганизацияНаУпрощеннойСистемеНалогообложения(Организация, Период);
		КонецЕсли;
		
		ПараметрыДляДоступныхТарифов.ВидОрганизации = ВидОрганизации;
		ПараметрыДляДоступныхТарифов.ПрименяетсяУСН = ПрименяетсяУСН;
		ПараметрыДляДоступныхТарифов.ПрименяетсяПоОтдельнымДоходам = ПрименяетсяПоОтдельнымДоходам;
		ПараметрыДляДоступныхТарифов.ЯвляетсяТерриториальнымТарифом = ЯвляетсяТерриториальнымТарифом;
		
	КонецЕсли;
	
	Возврат ПараметрыДляДоступныхТарифов;
	
КонецФункции

Процедура НачальноеЗаполнение() Экспорт
	
	СоздатьВидыТарифовСтраховыхВзносов();
	ЗаполнитьКодыВидовТарифаСтраховыхВзносов_2012();
	УточнитьПараметрыВидовТарифовСтраховыхВзносов();
	ОписатьТарифПредпринимателяПрименяющегоПатент();
	ВписатьКодыТарифов2015Года();
	ОписатьТарифРезидентаПортаВладивосток();
	ВписатьКодыФНС();
	ОписатьТарифМультипликаторов();
	ОписатьКалининградскийТариф();
	ОтметитьТерриториальныеТарифы();
	
КонецПроцедуры
	
Процедура СоздатьВидыТарифовСтраховыхВзносов()

	СписокОписанийТарифов = Новый Массив;
	// Строки не локализуются т.к. являются частью регламентированной формы, применяемой в РФ.
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ОбщийНалоговыйРежим";
	Описание.Наименование = "Основной тариф страховых взносов";
	Описание.КодПФР2011 = "01";
	Описание.КодФСС2011 = "071";
	СписокОписанийТарифов.Добавить(Описание);

	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "УпрощенныйНалоговыйРежим";
	Описание.Наименование = "Основной тариф, организации или ИП на УСН";
	Описание.КодПФР2011 = "51";
	Описание.КодФСС2011 = "071";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ЕНВД";
	Описание.Наименование = "Основной тариф, организации или ИП, уплачивающие ЕНВД";
	Описание.КодПФР2011 = "51";
	Описание.КодФСС2011 = "071";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "СельХозПроизводители";
	Описание.Наименование = "Организации-с/х производители, применяющие ОСН";
	Описание.КодПФР2011 = "02";
	Описание.КодФСС2011 = "041";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "НародныеХудожественныеПромыслы";
	Описание.Наименование = "Организации народных художественных промыслов и семейных (родовых) общин";
	Описание.КодПФР2011 = "02";
	Описание.КодФСС2011 = "071";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ОрганизацияИнвалидов";
	Описание.Наименование = "Организации инвалидов";
	Описание.КодПФР2011 = "03";
	Описание.КодФСС2011 = "061";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ЕСХН";
	Описание.Наименование = "Организации-с/х производители, уплачивающие ЕСХН";
	Описание.КодПФР2011 = "04";
	Описание.КодФСС2011 = "032";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ITОрганизации";
	Описание.Наименование = "Организации, работающие в области информационных технологий";
	Описание.КодПФР2011 = "06";
	Описание.КодФСС2011 = "091";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "УпрощенныйНалоговыйРежимПроизводство";
	Описание.Наименование = "Организации, применяющие УСН, занятые производством и приравненными видами деятельности";
	Описание.КодПФР2011 = "07";
	Описание.КодФСС2011 = "071";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ХозОбществаБюджетныхВУЗов";
	Описание.Наименование = "Хозяйственные общества, созданные бюджетными научными учреждениями и ВУЗами";
	Описание.КодПФР2011 = "08";
	Описание.КодФСС2011 = "101";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "СМИ";
	Описание.Наименование = "Организации - средства массовой информации";
	Описание.КодПФР2011 = "09";
	Описание.КодФСС2011 = "111";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "УчастникПроектаИнновационныйЦентрСколково";
	Описание.Наименование = "Участник проекта инновационный центр ""Сколково""";
	Описание.КодПФР2011 = "10";
	Описание.КодФСС2011 = "081";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ДляФармацевтовАптек";
	Описание.Наименование = "Для фармацевтов аптек";
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "НекоммерческиеОрганизации";
	Описание.Наименование = "Некоммерческие организации";
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "БлаготворительныеОрганизации";
	Описание.Наименование = "Благотворительные организации";
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ОрганизацииОказывающиеИнжиниринговыеУслуги";
	Описание.Наименование = "Организации, оказывающие инжиниринговые услуги";
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
			
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ДляЧленовЭкипажейМорскихСудовПодФлагомРФ";
	Описание.Наименование = "Для членов экипажей морских судов под флагом РФ";
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ИндивидуальныйПредпринимательПрименяющийПатент";
	Описание.Наименование = "Индивидуальный предприниматель, применяющий патент";
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "РезидентТехникоВнедренческойЗоны";
	Описание.Наименование = "Резиденты технико-внедренческой особой экономической зоны";
	Описание.КодПФР2011 = "36";
	Описание.КодФСС2011 = "051";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "УчастникОсобойЗоныВКрыму";
	Описание.Наименование = "Участник свободной экономической зоны в Крыму";
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития";
	Описание.Наименование = "Резидент территории опережающего социально-экономического развития";
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "РезидентПортаВладивосток";
	Описание.Наименование = "Резиденты свободного порта Владивосток";
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "Мультипликаторы";
	Описание.Наименование = "Организации-производители анимации";
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "РезидентОсобойЗоныВКалининградскойОбласти";
	Описание.Наименование = "Резидент особой зоны в Калининградской области";
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Счетчик = 1;
	Для каждого ОписаниеТарифа Из СписокОписанийТарифов Цикл
		
		СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыТарифовСтраховыхВзносов." + ОписаниеТарифа.Идентификатор);
		Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
			ВидТарифаОбъект = СсылкаПредопределенного.ПолучитьОбъект();
		Иначе
			ВидТарифаОбъект = Справочники.ВидыТарифовСтраховыхВзносов.СоздатьЭлемент();
			ВидТарифаОбъект.ИмяПредопределенныхДанных = ОписаниеТарифа.Идентификатор;
		КонецЕсли;

		Если ВидТарифаОбъект.РеквизитДопУпорядочивания <> Счетчик Тогда
			
			ВидТарифаОбъект.Наименование = ОписаниеТарифа.Наименование;
			ВидТарифаОбъект.КодПФР2011 = ОписаниеТарифа.КодПФР2011;
			ВидТарифаОбъект.КодФСС2011 = ОписаниеТарифа.КодФСС2011;
			ВидТарифаОбъект.РеквизитДопУпорядочивания = Счетчик;
			ВидТарифаОбъект.ОбменДанными.Загрузка = Истина;
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ВидТарифаОбъект.Записать();
			
		КонецЕсли;
			
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКодыВидовТарифаСтраховыхВзносов_2012() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""01"" КАК КодПФР2012,
	|	""071"" КАК КодФСС2012
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""18"",
	|	""041""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.СельХозПроизводители)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""52"",
	|	""071""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.УпрощенныйНалоговыйРежим)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""04"",
	|	""032""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ЕСХН)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""53"",
	|	""071""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ЕНВД)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""03"",
	|	""061""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОрганизацияИнвалидов)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""36"",
	|	""051""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.РезидентТехникоВнедренческойЗоны)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""10"",
	|	""081""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.УчастникПроектаИнновационныйЦентрСколково)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""06"",
	|	""091""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ITОрганизации)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""08"",
	|	""101""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ХозОбществаБюджетныхВУЗов)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""07"",
	|	""121""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.УпрощенныйНалоговыйРежимПроизводство)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""09"",
	|	""071""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.СМИ)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""19"",
	|	""042""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.НародныеХудожественныеПромыслы)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""15"",
	|	""131""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""11"",
	|	""141""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляФармацевтовАптек)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""12"",
	|	""151""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.НекоммерческиеОрганизации)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""13"",
	|	""161""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.БлаготворительныеОрганизации)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""14"",
	|	""071""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОрганизацииОказывающиеИнжиниринговыеУслуги)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВидТарифаОбъект,Выборка,,"Ссылка");
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры	

Процедура УточнитьПараметрыВидовТарифовСтраховыхВзносов() Экспорт

	Запрос = Новый Запрос;
	// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ.
	Запрос.УстановитьПараметр("УпрощенныйНалоговыйРежимНаименование", "Основной тариф, организации или ИП на УСН");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносов.ПрименяетсяПоОтдельнымДоходам КАК ПрименяетсяПоОтдельнымДоходам,
	|	&УпрощенныйНалоговыйРежимНаименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.УпрощенныйНалоговыйРежим)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	ИСТИНА,
	|	ВидыТарифовСтраховыхВзносов.Наименование
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ЕНВД)
	|	И НЕ ВидыТарифовСтраховыхВзносов.ПрименяетсяПоОтдельнымДоходам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	ИСТИНА,
	|	ВидыТарифовСтраховыхВзносов.Наименование
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|	И НЕ ВидыТарифовСтраховыхВзносов.ПрименяетсяПоОтдельнымДоходам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	ИСТИНА,
	|	ВидыТарифовСтраховыхВзносов.Наименование
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляФармацевтовАптек)
	|	И НЕ ВидыТарифовСтраховыхВзносов.ПрименяетсяПоОтдельнымДоходам";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВидТарифаОбъект,Выборка,,"Ссылка");
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

Процедура ОписатьТарифПредпринимателяПрименяющегоПатент() Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""16"" КАК КодПФР2012,
	|	""041"" КАК КодФСС2012
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ИндивидуальныйПредпринимательПрименяющийПатент)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВидТарифаОбъект,Выборка,,"Ссылка");
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

Процедура ВписатьКодыТарифов2015Года() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""23"" КАК КодПФР2012,
	|	""181"" КАК КодФСС2012
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.УчастникОсобойЗоныВКрыму)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""24"",
	|	""191""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВидТарифаОбъект,Выборка,,"Ссылка");
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры	

Процедура ОписатьТарифРезидентаПортаВладивосток() Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""25"" КАК КодПФР2012,
	|	""201"" КАК КодФСС2012
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.РезидентПортаВладивосток)
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВидТарифаОбъект,Выборка,,"Ссылка");
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

Процедура ВписатьКодыФНС() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	ВЫБОР
	|		КОГДА ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.УпрощенныйНалоговыйРежим)
	|			ТОГДА ""02""
	|		КОГДА ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ЕНВД)
	|			ТОГДА ""03""
	|		КОГДА ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ХозОбществаБюджетныхВУЗов)
	|			ТОГДА ""04""
	|		КОГДА ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.РезидентТехникоВнедренческойЗоны)
	|			ТОГДА ""05""
	|		КОГДА ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ITОрганизации)
	|			ТОГДА ""06""
	|		КОГДА ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|			ТОГДА ""07""
	|		КОГДА ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.УпрощенныйНалоговыйРежимПроизводство)
	|			ТОГДА ""08""
	|		КОГДА ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляФармацевтовАптек)
	|			ТОГДА ""09""
	|		КОГДА ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.НекоммерческиеОрганизации)
	|			ТОГДА ""10""
	|		КОГДА ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.БлаготворительныеОрганизации)
	|			ТОГДА ""11""
	|		КОГДА ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ИндивидуальныйПредпринимательПрименяющийПатент)
	|			ТОГДА ""12""
	|		КОГДА ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.УчастникПроектаИнновационныйЦентрСколково)
	|			ТОГДА ""13""
	|		КОГДА ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.УчастникОсобойЗоныВКрыму)
	|			ТОГДА ""14""
	|		КОГДА ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития)
	|			ТОГДА ""15""
	|		КОГДА ВидыТарифовСтраховыхВзносов.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.РезидентПортаВладивосток)
	|			ТОГДА ""16""
	|		ИНАЧЕ ""01""
	|	КОНЕЦ КАК КодФНС
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.КодФНС = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВидТарифаОбъект,Выборка, "КодФНС");
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры	

Процедура ОписатьТарифМультипликаторов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносов.КодФНС КАК КодФНС
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИмяПредопределенныхДанных = ""Мультипликаторы""";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВидТарифаОбъект = Справочники.ВидыТарифовСтраховыхВзносов.СоздатьЭлемент();
		ВидТарифаОбъект.ИмяПредопределенныхДанных = "Мультипликаторы";
		ВидТарифаОбъект.Наименование = "Организации-производители анимации";
		ВидТарифаОбъект.КодФНС = "18";
		ВидТарифаОбъект.ОбменДанными.Загрузка = Истина;
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий(); 
		Если Выборка.КодФНС <> "18" Тогда
			ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВидТарифаОбъект.КодФНС = "18";
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ВидТарифаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписатьКалининградскийТариф() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносов.КодФНС КАК КодФНС
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИмяПредопределенныхДанных = ""РезидентОсобойЗоныВКалининградскойОбласти""";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВидТарифаОбъект = Справочники.ВидыТарифовСтраховыхВзносов.СоздатьЭлемент();
		ВидТарифаОбъект.ИмяПредопределенныхДанных = "РезидентОсобойЗоныВКалининградскойОбласти";
		ВидТарифаОбъект.Наименование = "Резидент особой зоны в Калининградской области";
		ВидТарифаОбъект.КодФНС = "17";
		ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Истина;
		ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Истина;
		ВидТарифаОбъект.ОбменДанными.Загрузка = Истина;
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий(); 
		Если Выборка.КодФНС <> "17" Тогда
			ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВидТарифаОбъект.КодФНС = "17";
			ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Истина;
			ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Истина;
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ВидТарифаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтметитьТерриториальныеТарифы() Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка КАК Ссылка,
	|	ИСТИНА КАК ЯвляетсяТерриториальнымТарифом
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.Ссылка В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.РезидентПортаВладивосток), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.УчастникОсобойЗоныВКрыму), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.РезидентТехникоВнедренческойЗоны), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ))
	|	И НЕ ВидыТарифовСтраховыхВзносов.ЯвляетсяТерриториальнымТарифом";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВидТарифаОбъект,Выборка, "ЯвляетсяТерриториальнымТарифом");
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры


Функция ОписаниеТарифа()
	
	Возврат Новый Структура("Идентификатор, Наименование, КодПФР2011, КодФСС2011");
	
КонецФункции	

#КонецОбласти

#КонецЕсли
